CALL add_realty(
    1,
    1,
    2,
    1,
    'Бізнес-центр A',
    'Сучасна офісна будівля в центрі міста, ідеальна для ведення бізнесу.',
    'вул. Шевченка, 12',
    50000.00,
    5.00,
    500.5,
    '["https://pixabay.com/get/g31176e25d32a678b77d36dc5d940f965d58c8606e28a40f8756da50c9df905bf6c415e87f322d8393cdddc1afc6bc8dd5a6cb4ee03329b3fdd97bbf1ad137415_1280.jpg"]'
);
CALL add_realty(
    2,
    1,
    3,
    2,
    'Торговий центр B',
    'Великий торговий центр з численними приміщеннями для оренди чи купівлі.',
    'вул. Франка, 25',
    30000.00,
    5.00,
    1000.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);
CALL add_realty(
    3,
    3,
    1,
    3,
    'Житловий будинок C',
    'Комфортний житловий комплекс з квартирами для родин та окремих осіб.',
    'вул. Лесі Українки, 7',
    700000.00,
    5.00,
    120.0,
    '["https://pixabay.com/get/g31176e25d32a678b77d36dc5d940f965d58c8606e28a40f8756da50c9df905bf6c415e87f322d8393cdddc1afc6bc8dd5a6cb4ee03329b3fdd97bbf1ad137415_1280.jpg"]'
);
CALL add_realty(
    4,
    2,
    4,
    1,
    'Розкішна квартира D',
    'Сучасна квартира з преміальними зручностями для вибагливих клієнтів.',
    'вул. Миру, 10',
    5000.00,
    5.00,
    150.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);
CALL add_realty(
    5,
    1,
    4,
    5,
    'Склад E',
    'Просторий склад, підходить для промислових потреб і великого зберігання.',
    'вул. Південна, 40',
    1000000.00,
    5.00,
    3000.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);
CALL add_realty(
    1,
    2,
    1,
    1,
    'Затишна квартира F',
    'Затишна 2-кімнатна квартира в спокійному районі.',
    'вул. Небесної Сотні, 5',
    450000.00,
    5.00,
    80.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);
CALL add_realty(
    2,
    1,
    3,
    2,
    'Офісне приміщення G',
    'Офіс на центральній вулиці, ідеально підходить для стартапів та малого бізнесу.',
    'вул. Соборна, 15',
    850000.00,
    5.00,
    200.0,
    '["https://pixabay.com/get/g88cbd2b81bb92922e3a7c7c2a344e14ef0bda470b2ec5a9d4997005ea9afcb0dde374bc3b4ad4fbe246e40a15d6b493ae01aee0feef46aa7cf131416962b4aa6_1280.jpg"]'
);
CALL add_realty(
    3,
    2,
    4,
    3,
    'Сучасна квартира H',
    'Сучасна квартира з чудовими зручностями для молодих професіоналів.',
    'вул. Вокзальна, 22',
    600000.00,
    5.00,
    90.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);
CALL add_realty(
    4,
    4,
    2,
    1,
    'Промислова ділянка I',
    'Велика промислова ділянка для комерційного використання з можливістю розвитку.',
    'вул. Заводська, 80',
    1500000.00,
    5.00,
    5000.0,
    '["https://pixabay.com/get/g31176e25d32a678b77d36dc5d940f965d58c8606e28a40f8756da50c9df905bf6c415e87f322d8393cdddc1afc6bc8dd5a6cb4ee03329b3fdd97bbf1ad137415_1280.jpg"]'
);
CALL add_realty(
    5,
    3,
    2,
    2,
    'Будинок J',
    'Просторий будинок з великим двором, неподалік шкіл.',
    'вул. Шкільна, 14',
    1200000.00,
    5.00,
    200.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);


CALL add_realty(
    1,
    1,
    1,
    4,
    'Офісний центр K',
    'Елегантний офісний комплекс з сучасними зручностями в центрі міста.',
    'вул. Шевченка, 25',
    450000.00,
    5.00,
    300.0,
    '["https://pixabay.com/get/g31176e25d32a678b77d36dc5d940f965d58c8606e28a40f8756da50c9df905bf6c415e87f322d8393cdddc1afc6bc8dd5a6cb4ee03329b3fdd97bbf1ad137415_1280.jpg"]'
);

CALL add_realty(
    2,
    2,
    1,
    2,
    'Квартира у житловому комплексі',
    'Житловий комплекс для молодих сімей з сучасними зручностями.',
    'вул. Гагаріна, 10',
    700000.00,
    5.00,
    90.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);

CALL add_realty(
    3,
    2,
    5,
    3,
    'Квартира в центрі ',
    'Мінімалістична квартира в серці міста, ідеально підходить для молодих спеціалістів.',
    'вул. Центральна, 3',
    20000.00,
    5.00,
    60.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);

CALL add_realty(
    4,
    1,
    2,
    1,
    'Торговий центр',
    'Великий торговий центр з приміщеннями для роздрібної торгівлі та оренди.',
    'вул. Лісова, 19',
    1200000.00,
    5.00,
    1500.0,
    '["https://pixabay.com/get/g31176e25d32a678b77d36dc5d940f965d58c8606e28a40f8756da50c9df905bf6c415e87f322d8393cdddc1afc6bc8dd5a6cb4ee03329b3fdd97bbf1ad137415_1280.jpg"]'
);

CALL add_realty(
    5,
    1,
    1,
    4,
    'Ресторанна ділянка ',
    'Комерційна ділянка для ресторану з можливістю розширення.',
    'вул. Промислова, 8',
    2000000.00,
    5.00,
    2500.0,
    '["https://pixabay.com/get/g5658795e2be194f6ade1a1a887c66d57dea02b40e0830ac82c947ed590f6792d7cead907275c2be9812cf995839bd02ef68c880624e9801df013be6f92241181_1280.jpg"]'
);
